
## Pandas
#### Means PanelData
-       .One of the data scinece pakages
-       .Used for Data manupulation, analysis and cleaning
-       .Contains mainly two data structures in it
-            .1.Series
-           2 .DataFrames
-       .A series is a sequnece of data
-       .A data frame is data with rows and columns

In [2]:
import pandas as pd

In [3]:
pd.__version__

'1.2.4'

### 
#### Converting datastructures into series

In [7]:
s="good afternoon"
g=pd.Series(s)
g

0    good afternoon
dtype: object

In [9]:
s="good afternoon paramesh".split()
g=pd.Series(s)
g

0         good
1    afternoon
2     paramesh
dtype: object

In [11]:
s="good afternoon paramesh".split()
g=pd.Series(s,index=[1,2,3])
g

1         good
2    afternoon
3     paramesh
dtype: object

In [18]:
dict={"key1":1,"key2":2,"key3":3}
s=pd.Series(dict)
s

key1    1
key2    2
key3    3
dtype: int64

In [13]:
li=[123,"paramesh",965.63]
s=pd.Series(li)
s

0         123
1    paramesh
2      965.63
dtype: object

In [6]:
li=[123,"name","9.3"]
pd.Series(li,index=["int","str","float"])

int       123
str      name
float     9.3
dtype: object

In [14]:
tuple=(1,"paramesh",965.1)
s=pd.Series(tuple,index=[1,2,3])
s

1           1
2    paramesh
3       965.1
dtype: object

In [15]:
t=("a","e","i","o","u")
s=pd.Series(t,index=["vowel1","vowel2","vowel3","vowel4","vowel5"])
s

vowel1    a
vowel2    e
vowel3    i
vowel4    o
vowel5    u
dtype: object

In [17]:
dict={"key1":1,"key2":2,"key3":3}
s=pd.Series(dict,index=[1,2,3])
s

1   NaN
2   NaN
3   NaN
dtype: float64

In [19]:
dict={"key1":1,"key2":2,"key3":3}
s=pd.Series(dict)
s

key1    1
key2    2
key3    3
dtype: int64

### Converting data structures into DataFrames

In [21]:
a="good afternoon all".split()
d=pd.DataFrame(a)
d

           0
0       good
1  afternoon
2        all

In [22]:
a="good afternoon all".split()
d=pd.DataFrame(a,index=[1,2,3])
d

           0
1       good
2  afternoon
3        all

In [23]:
l=["123","abc",4,5.2]
d=pd.DataFrame(l,index=[1,2,3,4])
d

     0
1  123
2  abc
3    4
4  5.2

In [24]:
t=("a","b","c")
d=pd.DataFrame(t,index=[1,2,3])
d

   0
1  a
2  b
3  c

In [25]:
dict={"key1":1,"key2":"abc","key3":3.2}
d=pd.DataFrame(dict,index=[10,20,30])
d

    key1 key2  key3
10     1  abc   3.2
20     1  abc   3.2
30     1  abc   3.2

In [32]:
import numpy as np
d=np.arange(4,10,2)
a=pd.DataFrame(d)
c=pd.Series(d)
print(a)

   0
0  4
1  6
2  8

In [33]:
print(c)

0    4
1    6
2    8
dtype: int32

####  Data Analysis and Manupulation

In [13]:
li={"name":["xyz","abc","def"],"idno":[101,102,103],"marks":[100,200,300]}

pd.DataFrame(li,index=["stu1","stu2","stu3"])

     name  idno  marks
stu1  xyz   101    100
stu2  abc   102    200
stu3  def   103    300

In [35]:
df1=pd.DataFrame({"no of heros":[4,2,6,7],"no of person":[40,50,65,7]},index=[1999,1998,2000,2001])
df1

      no of heros  no of person
1999            4            40
1998            2            50
2000            6            65
2001            7             7

In [37]:
df2=pd.DataFrame({"no of days":[5,4,8,7],"rating":[1,2,3,5]},index=[1985,2000,1925,1893])
df2

      no of days  rating
1985           5       1
2000           4       2
1925           8       3
1893           7       5

In [38]:
## join
df1.join(df2)

      no of heros  no of person  no of days  rating
1999            4            40         NaN     NaN
1998            2            50         NaN     NaN
2000            6            65         4.0     2.0
2001            7             7         NaN     NaN

In [39]:
df2.join(df1)

      no of days  rating  no of heros  no of person
1985           5       1          NaN           NaN
2000           4       2          6.0          65.0
1925           8       3          NaN           NaN
1893           7       5          NaN           NaN

In [41]:
df3=pd.DataFrame({"a":[1,2,3,4],"b":[40,50,60,70]},index=[2000,2001,2002,2003])
df3

      a   b
2000  1  40
2001  2  50
2002  3  60
2003  4  70

In [48]:
df4=pd.DataFrame({"a":[1,2,3,4],"b":[40,50,65,70]},index=[2000,2001,2002,2003])
df4

      a   b
2000  1  40
2001  2  50
2002  3  65
2003  4  70

In [49]:
df3.merge(df4)

   a   b
0  1  40
1  2  50
2  4  70

In [45]:
df4.merge(df3)

   a   b
0  1  40
1  2  50
2  4  70

In [51]:
d=pd.concat((df1,df2))
d

      no of heros  no of person  no of days  rating
1999          4.0          40.0         NaN     NaN
1998          2.0          50.0         NaN     NaN
2000          6.0          65.0         NaN     NaN
2001          7.0           7.0         NaN     NaN
1985          NaN           NaN         5.0     1.0
2000          NaN           NaN         4.0     2.0
1925          NaN           NaN         8.0     3.0
1893          NaN           NaN         7.0     5.0

In [52]:
d=pd.concat([df4,df3])
d

      a   b
2000  1  40
2001  2  50
2002  3  65
2003  4  70
2000  1  40
2001  2  50
2002  3  60
2003  4  70

In [53]:
dates=pd.date_range("2021-06-01","2021-06-06")
d=pd.Series(dates)
d

0   2021-06-01
1   2021-06-02
2   2021-06-03
3   2021-06-04
4   2021-06-05
5   2021-06-06
dtype: datetime64[ns]

In [54]:
dates=pd.date_range("2021-06-01","2021-06-06")   # here there is no n-1    eg=range(1,n)===1,2,3,...n
d=pd.Series(dates,index=["mon","tues","wed","thur","fri","sat"])
d

mon    2021-06-01
tues   2021-06-02
wed    2021-06-03
thur   2021-06-04
fri    2021-06-05
sat    2021-06-06
dtype: datetime64[ns]

In [55]:
for x in range(1,5):
    print(x,end=" ")

1 2 3 4

In [57]:
a=pd.Series([1,2,3,4,12,25,2,40,60,5])

In [58]:
a[4]

12